test_result/fio-3.28-4R5J0001-sw-1G-qd1-num1-8K-3000-WT.txt
fio-3.28-4R5J0001-write-1G-1-1-8K: (g=0): rw=write, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685920,
  "timestamp_ms" : 1750685920746,
  "time" : "Mon Jun 23 21:38:40 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-write-1G-1-1-8K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 5,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-write-1G-1-1-8K",
        "filename" : "/dev/sda",
        "rw" : "write",
        "bs" : "8K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "1",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 231509664,
        "bw" : 226083,
        "iops" : 28260.457094,
        "runtime" : 4638,
        "total_ios" : 131072,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 2530,
          "max" : 59521,
          "mean" : 6143.750595,
          "stddev" : 2202.741331,
          "N" : 131072
        },
        "clat_ns" : {
          "min" : 1563,
          "max" : 282073,
          "mean" : 27964.533035,
          "stddev" : 3275.871310,
          "N" : 131072,
          "percentile" : {
            "1.000000" : 22656,
            "5.000000" : 22912,
            "10.000000" : 23168,
            "20.000000" : 23424,
            "30.000000" : 28544,
            "40.000000" : 28800,
            "50.000000" : 29056,
            "60.000000" : 29568,
            "70.000000" : 29824,
            "80.000000" : 30080,
            "90.000000" : 30848,
            "95.000000" : 31104,
            "99.000000" : 31872,
            "99.500000" : 32640,
            "99.900000" : 37632,
            "99.950000" : 45312,
            "99.990000" : 79360
          },
          "bins" : {
            "1560" : 1,
            "1768" : 1,
            "2160" : 1,
            "20608" : 1,
            "21376" : 1,
            "21888" : 2,
            "22144" : 2,
            "22400" : 152,
            "22656" : 2824,
            "22912" : 8721,
            "23168" : 11894,
            "23424" : 7968,
            "23680" : 2403,
            "23936" : 499,
            "24192" : 363,
            "24448" : 308,
            "24704" : 386,
            "24960" : 186,
            "25216" : 41,
            "25472" : 17,
            "25728" : 13,
            "25984" : 12,
            "26240" : 7,
            "26496" : 3,
            "26752" : 5,
            "27008" : 3,
            "27264" : 4,
            "27520" : 5,
            "27776" : 51,
            "28032" : 485,
            "28288" : 1915,
            "28544" : 5061,
            "28800" : 9655,
            "29056" : 12937,
            "29312" : 11195,
            "29568" : 10788,
            "29824" : 10144,
            "30080" : 8674,
            "30336" : 5944,
            "30592" : 4548,
            "30848" : 4836,
            "31104" : 4634,
            "31360" : 2462,
            "31616" : 599,
            "31872" : 254,
            "32128" : 206,
            "32384" : 136,
            "32640" : 117,
            "33024" : 127,
            "33536" : 43,
            "34048" : 44,
            "34560" : 63,
            "35072" : 68,
            "35584" : 35,
            "36096" : 46,
            "36608" : 29,
            "37120" : 17,
            "37632" : 14,
            "38144" : 9,
            "38656" : 12,
            "39168" : 4,
            "39680" : 2,
            "40192" : 6,
            "40704" : 2,
            "41728" : 6,
            "42240" : 4,
            "42752" : 4,
            "43264" : 3,
            "43776" : 1,
            "44800" : 3,
            "45312" : 1,
            "45824" : 1,
            "46336" : 1,
            "46848" : 1,
            "47872" : 1,
            "48384" : 1,
            "48896" : 1,
            "49920" : 1,
            "54528" : 1,
            "56064" : 2,
            "56576" : 1,
            "57088" : 3,
            "58112" : 1,
            "58624" : 4,
            "59136" : 2,
            "59648" : 4,
            "60160" : 1,
            "60672" : 2,
            "61184" : 5,
            "61696" : 3,
            "62208" : 4,
            "62720" : 4,
            "63232" : 3,
            "67072" : 1,
            "70144" : 1,
            "78336" : 1,
            "79360" : 2,
            "84480" : 1,
            "109056" : 1,
            "110080" : 1,
            "111104" : 1,
            "113152" : 2,
            "115200" : 1,
            "119296" : 1,
            "120320" : 1,
            "124416" : 1,
            "128512" : 1,
            "136192" : 1,
            "280576" : 1
          }
        },
        "lat_ns" : {
          "min" : 24701,
          "max" : 290273,
          "mean" : 34321.901794,
          "stddev" : 5399.740484,
          "N" : 131072
        },
        "bw_min" : 200720,
        "bw_max" : 292240,
        "bw_agg" : 100.000000,
        "bw_mean" : 227056.000000,
        "bw_dev" : 32734.994119,
        "bw_samples" : 9,
        "iops_min" : 25090,
        "iops_max" : 36528,
        "iops_mean" : 28382.000000,
        "iops_stddev" : 4091.656022,
        "iops_samples" : 9
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 4637,
      "usr_cpu" : 10.265258,
      "sys_cpu" : 30.580116,
      "ctx" : 131074,
      "majf" : 0,
      "minf" : 12,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.010000,
        "4" : 0.010000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 99.952698,
        "100" : 0.035858,
        "250" : 0.010000,
        "500" : 0.010000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 130914,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 4,
      "write_ticks" : 3491,
      "in_queue" : 3494,
      "util" : 98.054146
    }
  ]
}

fio-3.28-4R5J0001-write-1G-1-1-8K: (groupid=0, jobs=1): err= 0: pid=84147: Mon Jun 23 21:38:40 2025
  write: IOPS=28.3k, BW=221MiB/s (232MB/s)(1024MiB/4638msec); 0 zone resets
    slat (nsec): min=2530, max=59521, avg=6143.75, stdev=2202.74
    clat (nsec): min=1563, max=282073, avg=27964.53, stdev=3275.87
     lat (usec): min=24, max=290, avg=34.32, stdev= 5.40
    clat percentiles (nsec):
     |  1.00th=[22656],  5.00th=[22912], 10.00th=[23168], 20.00th=[23424],
     | 30.00th=[28544], 40.00th=[28800], 50.00th=[29056], 60.00th=[29568],
     | 70.00th=[29824], 80.00th=[30080], 90.00th=[30848], 95.00th=[31104],
     | 99.00th=[31872], 99.50th=[32640], 99.90th=[37632], 99.95th=[45312],
     | 99.99th=[79360]
   bw (  KiB/s): min=200720, max=292240, per=100.00%, avg=227056.00, stdev=32734.99, samples=9
   iops        : min=25090, max=36528, avg=28382.00, stdev=4091.66, samples=9
  lat (usec)   : 2=0.01%, 4=0.01%, 50=99.95%, 100=0.04%, 250=0.01%
  lat (usec)   : 500=0.01%
  cpu          : usr=10.27%, sys=30.58%, ctx=131074, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131072,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=221MiB/s (232MB/s), 221MiB/s-221MiB/s (232MB/s-232MB/s), io=1024MiB (1074MB), run=4638-4638msec

Disk stats (read/write):
  sda: ios=46/130914, merge=0/0, ticks=4/3491, in_queue=3494, util=98.05%